### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # linode_instance.ops_o11y_leaders[0] will be created
+   resource "linode_instance" "ops_o11y_leaders" {
+       backups            = (known after apply)
+       backups_enabled    = (known after apply)
+       boot_config_label  = (known after apply)
+       booted             = (known after apply)
+       group              = "ops-o11y"
+       host_uuid          = (known after apply)
+       id                 = (known after apply)
+       image              = "linode/ubuntu20.04"
+       ip_address         = (known after apply)
+       ipv4               = (known after apply)
+       ipv6               = (known after apply)
+       label              = "ops-vm-o11y-wkr-1"
+       private_ip_address = (known after apply)
+       region             = "us-east"
+       resize_disk        = false
+       root_pass          = (sensitive value)
+       shared_ipv4        = (known after apply)
+       specs              = (known after apply)
+       status             = (known after apply)
+       swap_size          = (known after apply)
+       type               = "g6-standard-2"
+       watchdog_enabled   = true
    }

  # linode_instance.ops_o11y_workers[0] will be created
+   resource "linode_instance" "ops_o11y_workers" {
+       backups            = (known after apply)
+       backups_enabled    = (known after apply)
+       boot_config_label  = (known after apply)
+       booted             = (known after apply)
+       group              = "ops-o11y"
+       host_uuid          = (known after apply)
+       id                 = (known after apply)
+       image              = "linode/ubuntu20.04"
+       ip_address         = (known after apply)
+       ipv4               = (known after apply)
+       ipv6               = (known after apply)
+       label              = "ops-vm-o11y-wkr-1"
+       private_ip_address = (known after apply)
+       region             = "us-east"
+       resize_disk        = false
+       root_pass          = (sensitive value)
+       shared_ipv4        = (known after apply)
+       specs              = (known after apply)
+       status             = (known after apply)
+       swap_size          = (known after apply)
+       type               = "g6-standard-2"
+       watchdog_enabled   = true
    }

  # linode_instance.ops_o11y_workers[1] will be created
+   resource "linode_instance" "ops_o11y_workers" {
+       backups            = (known after apply)
+       backups_enabled    = (known after apply)
+       boot_config_label  = (known after apply)
+       booted             = (known after apply)
+       group              = "ops-o11y"
+       host_uuid          = (known after apply)
+       id                 = (known after apply)
+       image              = "linode/ubuntu20.04"
+       ip_address         = (known after apply)
+       ipv4               = (known after apply)
+       ipv6               = (known after apply)
+       label              = "ops-vm-o11y-wkr-2"
+       private_ip_address = (known after apply)
+       region             = "us-east"
+       resize_disk        = false
+       root_pass          = (sensitive value)
+       shared_ipv4        = (known after apply)
+       specs              = (known after apply)
+       status             = (known after apply)
+       swap_size          = (known after apply)
+       type               = "g6-standard-2"
+       watchdog_enabled   = true
    }

  # linode_instance.ops_o11y_workers[2] will be created
+   resource "linode_instance" "ops_o11y_workers" {
+       backups            = (known after apply)
+       backups_enabled    = (known after apply)
+       boot_config_label  = (known after apply)
+       booted             = (known after apply)
+       group              = "ops-o11y"
+       host_uuid          = (known after apply)
+       id                 = (known after apply)
+       image              = "linode/ubuntu20.04"
+       ip_address         = (known after apply)
+       ipv4               = (known after apply)
+       ipv6               = (known after apply)
+       label              = "ops-vm-o11y-wkr-3"
+       private_ip_address = (known after apply)
+       region             = "us-east"
+       resize_disk        = false
+       root_pass          = (sensitive value)
+       shared_ipv4        = (known after apply)
+       specs              = (known after apply)
+       status             = (known after apply)
+       swap_size          = (known after apply)
+       type               = "g6-standard-2"
+       watchdog_enabled   = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>